#!/usr/bin/env python3.7

lookup_a = [
	# regular
	"a",  "e",  "i",  "o",  "u",
	"ka", "ke", "ki", "ko", "ku",
	"sa", "se", "shi", "so", "su",
	"ta", "te", "chi", "to", "tsu",
	"na", "ne", "ni", "no", "nu",
	"ha", "he", "hi", "ho", "fu",
	"ma", "me", "mi", "mo", "mu",
	"ra", "re", "ri", "ro", "ru",
	"ya", "yu", "yo",
	"wa", "wo",

	# dakuten
	"ga", "ge", "gi", "go", "gu",
	"za", "ze", "ji", "zo", "zu",
	"da", "de", "di", "do", "dzu",
	"ba", "be", "bi", "bo", "bu",

	# handakuten
	"pa", "pe", "pi", "po", "pu",

	# yoon
	"kya", "kyu", "kyo",
	"sha", "shu", "sho",
	"cha", "chu", "cho",
	"nya", "nyu", "nyo",
	"hya", "hyu", "hyo",
	"mya", "myu", "myo",
	"rya", "ryu", "ryo",
	"gya", "gyu", "gyo",
	"ja", "ju", "jo",
	"bya", "byu", "byo",
	"pya", "pyu", "pyo",

	# sokuon
	"kka", "kke", "kki", "kko", "kku",
	"ssa", "sse", "sshi", "sso", "ssu",
	"tta", "tte", "tchi", "tto", "ttsu",
	"ppa", "ppe", "ppi", "ppo", "ppu"
]

lookup_b = [
	# regular
	"あ", "え", "い", "お", "う",
	"か", "け", "き", "こ", "く",
	"さ", "せ", "し", "そ", "す",
	"た", "て", "ち", "と", "つ",
        "な", "ね", "に", "の", "ぬ",
        "は", "へ", "ひ", "ほ", "ふ",
        "ま", "め", "み", "も", "む",
        "ら", "れ", "り", "ろ", "る",
        "や", "ゆ", "よ",
        "わ", "を",

        # dakuten
        "が", "げ", "ぎ", "ご", "ぐ",
        "ざ", "ぜ", "じ", "ぞ", "ず",
        "だ", "で", "ぢ", "ど", "づ",
        "ば", "べ", "び", "ぼ", "ぶ",

        # handakuten
        "ぱ", "ぺ", "ぴ", "ぽ", "ぷ",

        # yoon
        "きゃ", "きゅ", "きょ",
        "しゃ", "しゅ", "しょ",
        "ちゃ", "ちゅ", "ちょ",
        "にゃ", "にゅ", "にょ",
        "ひゃ", "ひゅ", "ひょ",
        "みゃ", "みゅ", "みょ",
        "りゃ", "りゅ", "りょ",
        "ぎゃ", "ぎゅ", "ぎょ",
        "じゃ", "じゅ", "じょ",
        "びゃ", "びゅ", "びょ",
        "ぴゃ", "ぴゅ", "ぴょ",

        # sokuon
        "っか", "っけ", "っき", "っこ", "っく",
	"っさ", "っせ", "っし", "っそ", "っす",
        "った", "って", "っち", "っと", "っつ",
        "っぱ", "っぺ", "っぴ", "っぽ", "っぷ"
]

lookup_c = [
	"オ", "エ", "イ", "オ", "ウ",
	"カ", "ケ", "キ", "コ", "ク",
	"サ", "セ", "シ", "ソ", "ス",
	"タ", "テ", "チ", "ト", "ツ",
        "ナ", "ネ", "ニ", "ノ", "ヌ",
        "ハ", "ヘ", "ヒ", "ホ", "フ",
        "マ", "メ", "ミ", "モ", "ム",
        "ラ", "レ", "リ", "ロ", "ル",
        "ヤ", "ユ", "ヨ",
        "ワ", "ヲ",

        # dakuten
        "ガ", "ゲ", "ギ", "ゴ", "グ",
        "ザ", "ゼ", "ジ", "ゾ", "ズ",
        "ダ", "デ", "ヂ", "ド", "ヅ",
        "バ", "ベ", "ビ", "ボ", "ブ",

        # handakuten
        "パ", "ペ", "ピ", "ポ", "プ",

        # yoon
        "キャ", "キュ", "キョ",
        "シャ", "シュ", "ショ",
        "チャ", "チュ", "チョ",
        "ニャ", "ニュ", "ニョ",
        "ヒャ", "ヒュ", "ヒョ",
        "ミャ", "ミュ", "ミョ",
        "リャ", "リュ", "リョ",
        "ギャ", "ギュ", "ギョ",
        "ジャ", "ジュ", "ジョ",
        "ビャ", "ビュ", "ビョ",
        "ピャ", "ピュ", "ピョ",

        # sokuon
        "ッカ", "ッケ", "ッキ", "ッコ", "ック",
	"っさ", "っせ", "っし", "っそ", "っす",
        "った", "って", "っち", "っと", "っつ",
        "っぱ", "っぺ", "っぴ", "っぽ", "っぷ"
]

for i in range(0, len(lookup_a)):
	print("{\"" + lookup_a[i] + "\", std::pair<std::string, std::string>(\"" + lookup_b[i] + "\", \"" + lookup_c[i] + "\")},")

print("\n\n")

for i in range(0, len(lookup_a)):
	print("			b(\"" + lookup_a[i] + "\") else")
